### 1.Introduction 
     This assignment will help you to consolidate the concepts learnt in the session. 
### 2.Problem Statement 
     It happens all the time: someone gives you data containing malformed strings, Python, lists and missing data. How do you tidy it up so you can get on with the analysis? Take this monstrosity as the DataFrame to use in the following puzzles: 
     df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                        'Budapest_PaRis', 'Brussels_londOn'], 
                        'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                        'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
                        'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                        '12. Air France', '"Swiss Air"']}) 

1. Some values in the the FlightNumber column are missing. These numbers are meant to increase by 10 with each row so 10055 and 10075 need to be put in place. Fill in these missing numbers and make the column an integer column (instead of a float column). 
2. The From_To column would be better as two separate columns! Split each string on the underscore delimiter _ to give a new temporary DataFrame with the correct values. Assign the correct column names to this temporary DataFrame. 
3. Notice how the capitalisation of the city names is all mixed up in this temporary DataFrame. Standardise the strings so that only the first letter is uppercase (e.g. "londON" should become "London".) 
4. Delete the From_To column from df and attach the temporary DataFrame from the previous questions. 
5. In the RecentDelays column, the values have been entered into the DataFrame as a list. We would like each first value in its own column, each second value in its own column, and so on. If there isn't an Nth value, the value should be NaN. Expand the Series of lists into a DataFrame named delays, rename the columns delay_1, delay_2, etc. and replace the unwanted RecentDelays column in df with delays. 

Note: Solution submitted via github must contain all the source code and output. 

## 3. Expected Output 
    
This assignment consists of 200 marks and has to be submitted in .ipynb format in the upcoming session for evaluation.

In [20]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [21]:
df = pd.DataFrame({'From_To': ['LoNDon_paris', 'MAdrid_miLAN', 'londON_StockhOlm', 
                    'Budapest_PaRis', 'Brussels_londOn'], 
                    'FlightNumber': [10045, np.nan, 10065, np.nan, 10085], 
                    'RecentDelays': [[23, 47], [], [24, 43, 87], [13], [67, 32]], 
                    'Airline': ['KLM(!)', '<Air France> (12)', '(British Airways. )', 
                    '12. Air France', '"Swiss Air"']})

In [22]:
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris       10045.0      [23, 47]               KLM(!)
1      MAdrid_miLAN           NaN            []    <Air France> (12)
2  londON_StockhOlm       10065.0  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis           NaN          [13]       12. Air France
4   Brussels_londOn       10085.0      [67, 32]          "Swiss Air"

In [23]:
#1.)
nan_index=df[df['FlightNumber'].isnull()==True].index.to_list()
for ele in nan_index:
    df['FlightNumber'][ele]=df['FlightNumber'][ele-1]+10
df['FlightNumber']=df['FlightNumber'].astype(int)
df

            From_To  FlightNumber  RecentDelays              Airline
0      LoNDon_paris         10045      [23, 47]               KLM(!)
1      MAdrid_miLAN         10055            []    <Air France> (12)
2  londON_StockhOlm         10065  [24, 43, 87]  (British Airways. )
3    Budapest_PaRis         10075          [13]       12. Air France
4   Brussels_londOn         10085      [67, 32]          "Swiss Air"

In [24]:
#2.)
temp_df=pd.DataFrame(df['From_To'])
temp_df['From'],temp_df['To']=0,0
for ele in range(0,len(temp_df)):
    temp_df['From'][ele]=temp_df['From_To'].str.split("_")[ele][0]
    temp_df['To'][ele]=temp_df['From_To'].str.split("_")[ele][1]
temp_df.drop(columns=['From_To'],inplace=True)
temp_df

       From         To
0    LoNDon      paris
1    MAdrid      miLAN
2    londON  StockhOlm
3  Budapest      PaRis
4  Brussels     londOn

In [25]:
#3.)
for ele in range(0,len(temp_df)):
    temp_df['From'][ele]=temp_df['From'][ele].capitalize()
    temp_df['To'][ele]=temp_df['To'][ele].capitalize()
temp_df

       From         To
0    London      Paris
1    Madrid      Milan
2    London  Stockholm
3  Budapest      Paris
4  Brussels     London

In [26]:
df.drop(columns=['From_To'],inplace=True)
df=pd.concat([df,temp_df],axis=1)
df

   FlightNumber  RecentDelays              Airline      From         To
0         10045      [23, 47]               KLM(!)    London      Paris
1         10055            []    <Air France> (12)    Madrid      Milan
2         10065  [24, 43, 87]  (British Airways. )    London  Stockholm
3         10075          [13]       12. Air France  Budapest      Paris
4         10085      [67, 32]          "Swiss Air"  Brussels     London

In [27]:
maxvar_len=max([len(ele) for ele in df['RecentDelays']])
for ele in range(0,maxvar_len):
    df['delay_'+str(ele+1)]=np.nan
for ele in range(0,len(df)):
    element=df['RecentDelays'][ele]
    for ele1 in range(0,len(element)):
        df['delay_'+str(ele1+1)][ele]=element[ele1]
df.drop(columns=['RecentDelays'],inplace=True)
df

   FlightNumber              Airline      From  ... delay_1  delay_2  delay_3
0         10045               KLM(!)    London  ...    23.0     47.0      NaN
1         10055    <Air France> (12)    Madrid  ...     NaN      NaN      NaN
2         10065  (British Airways. )    London  ...    24.0     43.0     87.0
3         10075       12. Air France  Budapest  ...    13.0      NaN      NaN
4         10085          "Swiss Air"  Brussels  ...    67.0     32.0      NaN

[5 rows x 7 columns]